renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rspi.c
/************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2018(2019) Renesas Electronics Corporation. All rights reserved.
*************************************************************************************************/
/************************************************************************************************
* System Name  : MEMDRV  software
* File Name    : r_memdrv_rspi.c
* Version      : 1.02
* Device       : -
* Abstract     : IO I/F module
* Tool-Chain   : -
* OS           : not use
* H/W Platform : -
* Description  : MEMDRV I/O file
* Limitation   : None
*************************************************************************************************/
/************************************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 15.12.2018 1.00     Initial Release
*              : 04.04.2019 1.01     Added support for GNUC and ICCRX.
*                                    Fixed coding style.
*              : 22.11.2019 1.02     The module is updated to fix the software issue.
*                                    When r_memdrv_rspi_write_data function is called, 
*                                    there are cases when transmit data/receive data are not processed successfully.
*                                    The issue occurs when the number of transmit is set to a value of 1024 byte.
*                                    Corrected parameter type of the r_memdrv_rspi_write_data function.
*                                    Corrected parameter type of the r_memdrv_rspi_read_data function.
*************************************************************************************************/

/************************************************************************************************
Includes <System Includes> , "Project Includes"
*************************************************************************************************/
#include "r_memdrv_rx_if.h"                      /* MEMDRV driver I/F definitions                  */
#include "r_memdrv_rx_config.h"                  /* MEMDRV driver Configuration definitions        */
#include "./src/r_memdrv_rx_private.h"           /* MEMDRV driver Private module definitions       */
/* Check driver interface. */
#if ((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR == MEMDRV_DRVR_RX_FIT_RSPI)) || \
    ((MEMDRV_CFG_DEV1_INCLUDED == 1) && (MEMDRV_CFG_DEV1_MODE_DRVR == MEMDRV_DRVR_RX_FIT_RSPI))
#include "r_pinset.h"
/************************************************************************************************
Macro definitions
*************************************************************************************************/
#define RSPI_TIMER_CH_FLG          (0)
#define RSPI_TIMER_CH_COUNT        (1)
#define RSPI_TIMER_CH_MAX_COUNT    (2)
#define RSPI_TIMER_MIN_TIME        (100)       /* 100ms             */
#define RSPI_SECTOR_SIZE           (512)       /* 1 sector size     */
#define RSPI_TRAN_SIZE             (4)
#define RSPI_EXCHG_MAX_COUNT       (65532)
/************************************************************************************************
Typedef definitions
*************************************************************************************************/

/************************************************************************************************
Exported global variables (to be accessed by other files)
*************************************************************************************************/
volatile bool  g_transfer_busy = false;
rspi_handle_t g_rspi_handle;
/************************************************************************************************
Private global variables and functions
*************************************************************************************************/
static rspi_evt_t callback_event; 
static volatile uint32_t gs_memdrv_rspi_timer_cnt_out[RSPI_MAX_CHANNELS][RSPI_TIMER_CH_MAX_COUNT + 1];
#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC) | \
    (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)   | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
static uint8_t rev_buf[RSPI_SECTOR_SIZE];
#endif

static void                 r_memdrv_rspi_start_timer(uint8_t channel, uint32_t msec);
static memdrv_err_t         r_memdrv_rspi_check_timer(uint8_t channel);
static void                 r_memdrv_rspi_end_timer(uint8_t channel);
static memdrv_err_t         r_memdrv_rspi_wait(uint8_t channel, uint32_t size);
static void                 r_memdrv_rspi_callback(void *p_data);
static void                 rspi_init_ports(void);

static memdrv_err_t r_rspi_exchg(uint8_t * p_data, uint16_t size);
static rspi_str_tranmode_t r_memdrv_rspi_set_tran_mode(uint8_t devno);
static memdrv_err_t r_memdrv_rspi_disable_tx_data_dmac(uint8_t devno,
                                                       st_memdrv_info_t * p_memdrv_info);
static memdrv_err_t r_memdrv_rspi_disable_rx_data_dmac(uint8_t devno,
                                                       st_memdrv_info_t * p_memdrv_info);
static memdrv_err_t r_memdrv_rspi_enable_tx_data_dmac(uint8_t devno,
                                                      st_memdrv_info_t * p_memdrv_info);
static memdrv_err_t r_memdrv_rspi_enable_rx_data_dmac(uint8_t devno,
                                                      st_memdrv_info_t * p_memdrv_info);
static memdrv_err_t r_memdrv_rspi_disable_tx_data_dtc(uint8_t devno,
                                                      st_memdrv_info_t * p_memdrv_info);
static memdrv_err_t r_memdrv_rspi_disable_rx_data_dtc(uint8_t devno,
                                                      st_memdrv_info_t * p_memdrv_info);
static memdrv_err_t r_memdrv_rspi_enable_tx_data_dtc(uint8_t devno,
                                                     st_memdrv_info_t * p_memdrv_info);
static memdrv_err_t r_memdrv_rspi_enable_rx_data_dtc(uint8_t devno,
                                                     st_memdrv_info_t * p_memdrv_info);
static memdrv_err_t r_memdrv_rspi_write_data(uint8_t channel, uint16_t count,
                                             uint8_t * pdata, rspi_command_word_t cmd);
static memdrv_err_t r_memdrv_rspi_read_data(uint8_t channel, uint16_t count,
                                            uint8_t * pdata, rspi_command_word_t cmd);

/************************************************************************************************
* Function Name: r_memdrv_rspi_open
* Description  : Initializes I/O driver.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_rspi_open(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    rspi_chnl_settings_t config;
    rspi_command_word_t spcmd_cmd_word;
    
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    if (MEMDRV_DEV0 == devno)
    {
        config.bps_target = (uint32_t)MEMDRV_CFG_DEV0_BR;
    }
    else if (MEMDRV_DEV1 == devno)
    {
        config.bps_target = (uint32_t)MEMDRV_CFG_DEV1_BR;
    }

