renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rspi.c
    config.master_slave_mode = RSPI_MS_MODE_MASTER;
    config.gpio_ssl = RSPI_IF_MODE_3WIRE;
#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
    config.tran_mode = RSPI_TRANS_MODE_DMAC;
#elif (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
    config.tran_mode = RSPI_TRANS_MODE_DTC;
#else
    config.tran_mode = RSPI_TRANS_MODE_SW;
#endif

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif /* (__ICCRX__) */
#endif

#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
    if (MEMDRV_SUCCESS != r_memdrv_dmac_open())
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#elif (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
    if (MEMDRV_SUCCESS != r_memdrv_dtc_open())
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif

    if (RSPI_SUCCESS != R_RSPI_Open (channel,     
                               &config,     
                               spcmd_cmd_word,    
                               &r_memdrv_rspi_callback,   
                               &g_rspi_handle))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    rspi_init_ports();
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_open() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_close
* Description  : Resets I/O driver.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_rspi_close(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    uint8_t channel = r_memdrv_get_drv_ch(devno);

#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
    if (MEMDRV_SUCCESS != r_memdrv_dmac_close())
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#elif (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
    if (MEMDRV_SUCCESS != r_memdrv_dtc_close())
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif
    
    g_rspi_handle->channel = channel;
    if (RSPI_SUCCESS != R_RSPI_Close(g_rspi_handle))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_close() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_disable
* Description  : Disables I/O driver.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_rspi_disable(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_disable() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_disable_tx_data
* Description  : Disables I/O driver for writing data.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_rspi_disable_tx_data(uint8_t devno,
                                           st_memdrv_info_t * p_memdrv_info)
{
#if (MEMDRV_CFG_DEV0_TYPE == 1)  | (MEMDRV_CFG_DEV1_TYPE == 1)
    /* Casting to a uint32_t type is valid. */
    if (MEMDRV_ADDR_BOUNDARY & (uint32_t)p_memdrv_info->p_data)
    {
        /* If the buffer address is not 4 bytes alignment, force to perform the CPU transfer. */
        R_BSP_NOP();
    }
    else if (MEMDRV_CHK_MULT_OF_4 & p_memdrv_info->cnt)
    {
        /* If the data counter is not multiple of 4, force to perform the CPU transfer. */
        R_BSP_NOP();
    }
    else
    {
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_tx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_tx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_tx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_tx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
    }
#endif
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_disable_tx_data() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_disable_tx_data_dmac
* Description  : Disables I/O driver for writing data and DMAC.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static memdrv_err_t r_memdrv_rspi_disable_tx_data_dmac(uint8_t devno,
                                                       st_memdrv_info_t * p_memdrv_info)
{
#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    st_memdrv_dmac_info_t dmac_info;
    dmaca_stat_t stat_dmac;

    dmac_info.drv           = MEMDRV_DRVR_RX_FIT_RSPI;
    dmac_info.p_stat_dmac   = &stat_dmac;

