renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rspi.c
    if (MEMDRV_DEV0 == devno)
    {
        dmac_info.channel   = MEMDRV_CFG_DEV0_DMAC_CH_NO_Tx;
    }
    else
    {
        dmac_info.channel   = MEMDRV_CFG_DEV1_DMAC_CH_NO_Tx;
    }

    if (r_memdrv_dmac_disable(&dmac_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    if (MEMDRV_DEV0 == devno)
    {
        dmac_info.channel   = MEMDRV_CFG_DEV0_DMAC_CH_NO_Rx;
    }
    else
    {
        dmac_info.channel   = MEMDRV_CFG_DEV1_DMAC_CH_NO_Rx;
    }

    if (r_memdrv_dmac_disable(&dmac_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif /* (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC) */

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_disable_tx_data_dmac() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_disable_tx_data_dtc
* Description  : Disables I/O driver for writing data and DTC.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static memdrv_err_t r_memdrv_rspi_disable_tx_data_dtc(uint8_t devno,
                                                      st_memdrv_info_t * p_memdrv_info)
{
#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    st_memdrv_dtc_info_t dtc_info;

    switch (channel)
    {
        case 0:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0)
            dtc_info.act_source = DTCE_RSPI0_SPTI0;
    #endif
        }
        break;
        case 1:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1)
            dtc_info.act_source = DTCE_RSPI1_SPTI1;
    #endif
        }
        break;
        case 2:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2)
            dtc_info.act_source = DTCE_RSPI2_SPTI2;
    #endif
        }
        break;
        default:
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
        break;
    }

    if (r_memdrv_dtc_disable(&dtc_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }


    switch (channel)
    {
        case 0:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0)
            dtc_info.act_source = DTCE_RSPI0_SPRI0;
    #endif
        }
        break;
        case 1:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1)
            dtc_info.act_source = DTCE_RSPI1_SPRI1;
    #endif
        }
        break;
        case 2:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2)
            dtc_info.act_source = DTCE_RSPI2_SPRI2;
    #endif
        }
        break;
        default:
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
        break;
    }

    if (r_memdrv_dtc_disable(&dtc_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif  /* (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC) */

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_disable_tx_data_dtc() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_disable_rx_data
* Description  : Disables I/O driver for reading data.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_rspi_disable_rx_data(uint8_t devno,
                                           st_memdrv_info_t * p_memdrv_info)
{
#if (MEMDRV_CFG_DEV0_TYPE == 1)  | (MEMDRV_CFG_DEV1_TYPE == 1)
    /* Casting to a uint32_t type is valid. */
    if (MEMDRV_ADDR_BOUNDARY & (uint32_t)p_memdrv_info->p_data)
    {
        /* If the buffer address is not 4 bytes alignment, force to perform the CPU transfer. */
        R_BSP_NOP();
    }
    else if (MEMDRV_CHK_MULT_OF_4 & p_memdrv_info->cnt)
    {
        /* If the data counter is not multiple of 4, force to perform the CPU transfer. */
        R_BSP_NOP();
    }
    else
    {
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_rx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_rx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_rx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_rx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
    }
#endif
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_disable_rx_data() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_disable_rx_data_dmac
* Description  : Disables I/O driver for reading data and DMAC.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static memdrv_err_t r_memdrv_rspi_disable_rx_data_dmac(uint8_t devno,
                                                       st_memdrv_info_t * p_memdrv_info)
{
#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC) | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    st_memdrv_dmac_info_t dmac_info;
    dmaca_stat_t stat_dmac;

    dmac_info.drv           = MEMDRV_DRVR_RX_FIT_RSPI;
    dmac_info.p_stat_dmac   = &stat_dmac;

