renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rspi.c
    if (r_memdrv_dtc_enable(&dtc_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    dtc_info.drv            = MEMDRV_DRVR_RX_FIT_RSPI;
    dtc_info.src_adr        = reg_adr;
    dtc_info.dst_adr        = (uint32_t)&rev_buf;
    dtc_info.block_size     = 0;
    dtc_info.cnt            = p_memdrv_info->cnt;
    dtc_info.p_dtc_cfg      = &dtc_cfg;
    dtc_info.p_dtc_transfer = &g_memdrv_dtc_info[devno][MEMDRV_INDEX_DTC_RX];
    switch (channel)
    {
        case 0:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0)
            dtc_info.act_source = DTCE_RSPI0_SPRI0;
    #endif
        }
        break;
        case 1:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1)
            dtc_info.act_source = DTCE_RSPI1_SPRI1;
    #endif
        }
        break;
        case 2:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2)
            dtc_info.act_source = DTCE_RSPI2_SPRI2;
    #endif
        }
        break;
        default:
        {
           R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
           return MEMDRV_ERR_OTHER;
        }
        break;
    }

    r_memdrv_dtc_set_rx(&dtc_info);

    if (r_memdrv_dtc_enable(&dtc_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif  /* (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC) */

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_enable_tx_data_dtc() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_enable_rx_data
* Description  : Enables I/O driver for reading data.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_rspi_enable_rx_data(uint8_t devno,
                                          st_memdrv_info_t * p_memdrv_info)
{
    rspi_cmd_baud_t rspi_bitrate;
    uint8_t channel = r_memdrv_get_drv_ch(devno);

    if (MEMDRV_DEV0 == devno)
    {
        rspi_bitrate.bps_target = (uint32_t)MEMDRV_CFG_DEV0_BR_READ_DATA;
    }
    else if (MEMDRV_DEV1 == devno)
    {
        rspi_bitrate.bps_target = (uint32_t)MEMDRV_CFG_DEV1_BR_READ_DATA;
    }

    g_rspi_handle->channel = channel;
    /* Casting to a uint32_t type is valid. */
    if (R_RSPI_Control(g_rspi_handle, RSPI_CMD_SET_BAUD, &rspi_bitrate) != RSPI_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#if (MEMDRV_CFG_DEV0_TYPE == 1)  | (MEMDRV_CFG_DEV1_TYPE == 1)
    /* Casting to a uint32_t type is valid. */
    if (MEMDRV_ADDR_BOUNDARY & (uint32_t)p_memdrv_info->p_data)
    {
        /* If the buffer address is not 4 bytes alignment, force to perform the CPU transfer. */
        R_BSP_NOP();
    }
    else if (MEMDRV_CHK_MULT_OF_4 & p_memdrv_info->cnt)
    {
        /* If the data counter is not multiple of 4, force to perform the CPU transfer. */
        R_BSP_NOP();
    }
    else
    {
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_enable_rx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_enable_rx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_enable_rx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_enable_rx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
    }
#endif
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_enable_rx_data() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_enable_rx_data_dmac
* Description  : Enables I/O driver for reading data and DMAC.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static memdrv_err_t r_memdrv_rspi_enable_rx_data_dmac(uint8_t devno,
                                                      st_memdrv_info_t * p_memdrv_info)
{
#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    st_memdrv_dmac_info_t dmac_info;
    dmaca_transfer_data_cfg_t dmac_cfg;
    uint32_t reg_adr = 0;
    dmaca_stat_t stat_dmac;
    
    g_rspi_handle->channel = channel;
    if (R_RSPI_GetBuffRegAddress(g_rspi_handle, &reg_adr) != RSPI_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    dmac_info.drv           = MEMDRV_DRVR_RX_FIT_RSPI;
    dmac_info.src_adr       = (uint32_t)&g_memdrv_dummy_tx;
    dmac_info.dst_adr       = reg_adr;
    dmac_info.block_size    = 0;
    dmac_info.cnt           = p_memdrv_info->cnt;
    dmac_info.p_dmac_cfg    = &dmac_cfg;
    dmac_info.p_stat_dmac   = &stat_dmac;

