renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rspi.c
    if (MEMDRV_DEV0 == devno)
    {
        dmac_info.channel   = MEMDRV_CFG_DEV0_DMAC_CH_NO_Tx;
    }
    else
    {
        dmac_info.channel   = MEMDRV_CFG_DEV1_DMAC_CH_NO_Tx;
    }
    
    switch (channel)
    {
        case 0:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0)
            dmac_info.act_source = IR_RSPI0_SPTI0;
    #endif
        }
        break;
        case 1:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1)
            dmac_info.act_source = IR_RSPI1_SPTI1;
    #endif
        }
        break;
        case 2:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2)
            dmac_info.act_source = IR_RSPI2_SPTI2;
    #endif
        }
        break;
        default:
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
        break;
    }

    r_memdrv_dmac_set_tx(&dmac_info);
    dmac_info.p_dmac_cfg->src_addr_mode = DMACA_SRC_ADDR_FIXED; // Dummy

    if (r_memdrv_dmac_enable(&dmac_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    dmac_info.drv           = MEMDRV_DRVR_RX_FIT_RSPI;
    dmac_info.src_adr       = reg_adr;
    dmac_info.dst_adr       = (uint32_t)p_memdrv_info->p_data;
    dmac_info.block_size    = 0;
    dmac_info.cnt           = p_memdrv_info->cnt;
    dmac_info.p_dmac_cfg    = &dmac_cfg;
    dmac_info.p_stat_dmac   = &stat_dmac;

    if (MEMDRV_DEV0 == devno)
    {
        dmac_info.channel   = MEMDRV_CFG_DEV0_DMAC_CH_NO_Rx;
    }
    else
    {
        dmac_info.channel   = MEMDRV_CFG_DEV1_DMAC_CH_NO_Rx;
    }
    
    switch (channel)
    {
        case 0:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0)
            dmac_info.act_source = IR_RSPI0_SPRI0;
    #endif
        }
        break;
        case 1:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1)
            dmac_info.act_source = IR_RSPI1_SPRI1;
    #endif
        }
        break;
        case 2:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2)
            dmac_info.act_source = IR_RSPI2_SPRI2;
    #endif
        }
        break;
        default:
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
        break;
    }

    r_memdrv_dmac_set_rx(&dmac_info);

    if (r_memdrv_dmac_enable(&dmac_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif /* (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC) */

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_enable_rx_data_dmac() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_enable_rx_data_dtc
* Description  : Enables I/O driver for reading data and DTC.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static memdrv_err_t r_memdrv_rspi_enable_rx_data_dtc(uint8_t devno,
                                                     st_memdrv_info_t * p_memdrv_info)
{
#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    st_memdrv_dtc_info_t dtc_info;
    dtc_transfer_data_cfg_t dtc_cfg;
    uint32_t reg_adr = 0;
    
    g_rspi_handle->channel = channel;
    if (R_RSPI_GetBuffRegAddress(g_rspi_handle, &reg_adr) != RSPI_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    dtc_info.drv            = MEMDRV_DRVR_RX_FIT_RSPI;
    dtc_info.src_adr        = (uint32_t)&g_memdrv_dummy_tx;
    dtc_info.dst_adr        = reg_adr;
    dtc_info.block_size     = 0;
    dtc_info.cnt            = p_memdrv_info->cnt;
    dtc_info.p_dtc_cfg      = &dtc_cfg;
    dtc_info.p_dtc_transfer = &g_memdrv_dtc_info[devno][MEMDRV_INDEX_DTC_TX];
    switch (channel)
    {
        case 0:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0)
            dtc_info.act_source = DTCE_RSPI0_SPTI0;
    #endif
        }
        break;
        case 1:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1)
            dtc_info.act_source = DTCE_RSPI1_SPTI1;
    #endif
        }
        break;
        case 2:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2)
            dtc_info.act_source = DTCE_RSPI2_SPTI2;
    #endif
        }
        break;
        default:
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
        break;
    }

    r_memdrv_dtc_set_tx(&dtc_info);
    dtc_info.p_dtc_cfg->src_addr_mode = DTC_SRC_ADDR_FIXED; // Dummy 

