renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rspi.c
    uint32_t                bound_cnt = 0;
    uint8_t *               pdsrc = p_memdrv_info->p_data;
    uint32_t                txcnt = p_memdrv_info->cnt;

    uint32_t                rem_txcnt = txcnt / RSPI_EXCHG_MAX_COUNT;
    uint32_t                mod_txcnt = txcnt % RSPI_EXCHG_MAX_COUNT;


    if (0 != ((uint32_t)(p_memdrv_info->p_data) & MEMDRV_ADDR_BOUNDARY))
    {
        bound_cnt = (0x00000004 - ((uint32_t)(p_memdrv_info->p_data) & MEMDRV_ADDR_BOUNDARY));
        txcnt = bound_cnt;
        mode.transfer_mode = RSPI_TRANS_MODE_SW;
#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif /* (__ICCRX__) */
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }

        ret_memdrv = r_memdrv_rspi_write_data(channel, txcnt, pdsrc, spcmd_cmd_word);
        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            return MEMDRV_ERR_OTHER;
        }
        pdsrc = (uint8_t *)(p_memdrv_info->p_data + bound_cnt);
        txcnt = p_memdrv_info->cnt - bound_cnt;
    }
    if (0 != (txcnt & 0xfffffffc))
    {
        txcnt = (txcnt & 0xfffffffc);
        mode.transfer_mode = r_memdrv_rspi_set_tran_mode(devno);

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_DATA_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_DATA_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_DATA_CMD;
#endif /* (__ICCRX__) */
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_enable_tx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_enable_tx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_enable_tx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_enable_tx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        r_rspi_exchg(pdsrc, txcnt);
        /* Turn 32 digits into 16 digits */
        if (rem_txcnt >= 1)
        {
            /* WAIT_LOOP */
            while(rem_txcnt)
            {
                ret_memdrv = r_memdrv_rspi_write_data(channel, RSPI_EXCHG_MAX_COUNT, pdsrc, spcmd_cmd_word);
                if (MEMDRV_SUCCESS != ret_memdrv)
                {
                    return ret_memdrv;
                }
                pdsrc = (uint8_t *)(pdsrc + RSPI_EXCHG_MAX_COUNT);
                rem_txcnt--;
            }
            ret_memdrv = r_memdrv_rspi_write_data(channel, mod_txcnt, pdsrc, spcmd_cmd_word);
        }
        else
        {
            ret_memdrv = r_memdrv_rspi_write_data(channel, txcnt, pdsrc, spcmd_cmd_word);
        }

        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            r_rspi_exchg(pdsrc, txcnt);
            return MEMDRV_ERR_OTHER;
        }
        r_rspi_exchg(pdsrc, txcnt);
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_tx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_tx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_tx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_tx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        pdsrc = (uint8_t *)(pdsrc + txcnt);
    }
    if (0 != ((uint32_t)(p_memdrv_info->cnt - bound_cnt) & MEMDRV_CHK_MULT_OF_4))
    {
        txcnt = (uint32_t)((p_memdrv_info->cnt - bound_cnt) & MEMDRV_CHK_MULT_OF_4);
        mode.transfer_mode = RSPI_TRANS_MODE_SW;

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif /* (__ICCRX__) */
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }


