renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rspi.c
        ret_memdrv = r_memdrv_rspi_write_data(channel, txcnt, pdsrc, spcmd_cmd_word);
        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            return MEMDRV_ERR_OTHER;
        }
    }

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_tx_data() */
#endif
/************************************************************************************************
* Function Name: r_memdrv_rspi_rx
* Description  : Receives data for status register and Read ID.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_HARD                        ;   Hardware error
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_rspi_rx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    uint8_t                 channel = r_memdrv_get_drv_ch(devno);
    memdrv_err_t            ret_memdrv = MEMDRV_SUCCESS;
    rspi_command_word_t     spcmd_cmd_word;

#if ((MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)   | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC))
    rspi_cmd_trans_mode_t   mode;
    rspi_err_t              ret_drv = RSPI_SUCCESS;
#endif

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif /* (__ICCRX__) */
#endif

#if ((MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)   | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC))
    mode.transfer_mode = RSPI_TRANS_MODE_SW;
    ret_drv = R_RSPI_Control(g_rspi_handle,
                             RSPI_CMD_SET_TRANS_MODE,
                             (void *)&mode);
    if (RSPI_SUCCESS != ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif

    ret_memdrv = r_memdrv_rspi_read_data(channel, p_memdrv_info->cnt, p_memdrv_info->p_data, spcmd_cmd_word);
    if (MEMDRV_SUCCESS != ret_memdrv)
    {
        return MEMDRV_ERR_OTHER;
    }
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_rx() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_rx_data
* Description  : Receives data using the single mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                       ;   Successful operation
*              : MEMDRV_ERR_HARD                      ;   Hardware error
*              : MEMDRV_ERR_OTHER                     ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
#if (MEMDRV_CFG_DEV0_TYPE ==1)  | (MEMDRV_CFG_DEV1_TYPE ==1)
memdrv_err_t r_memdrv_rspi_rx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    rspi_command_word_t     spcmd_cmd_word;
    rspi_err_t     ret_drv = RSPI_SUCCESS;
    memdrv_err_t            ret_memdrv = MEMDRV_SUCCESS;
    rspi_cmd_trans_mode_t   mode;

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_DATA_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_DATA_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_DATA_CMD;
#endif /* (__ICCRX__) */
#endif

    /* Set transfer mode. */
    if (MEMDRV_ADDR_BOUNDARY & (uint32_t)p_memdrv_info->p_data)
    {
        /* If the buffer address is not 4 bytes alignment, force to perform the CPU transfer. */
        mode.transfer_mode = RSPI_TRANS_MODE_SW;
#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif /* (__ICCRX__) */
#endif
    }
    else if (MEMDRV_CHK_MULT_OF_4 & p_memdrv_info->cnt)
    {
        /* If the data counter is not multiple of 4, force to perform the CPU transfer. */
        mode.transfer_mode = RSPI_TRANS_MODE_SW;
#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif /* (__ICCRX__) */
#endif
    }
    else
    {
        mode.transfer_mode = r_memdrv_rspi_set_tran_mode(devno);
    }
    ret_drv = R_RSPI_Control(g_rspi_handle,
                             RSPI_CMD_SET_TRANS_MODE,
                             (void *)&mode);
    if (RSPI_SUCCESS != ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
    
