renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rspi.c
    r_rspi_exchg(p_memdrv_info->p_data, p_memdrv_info->cnt);
    ret_memdrv = r_memdrv_rspi_read_data(channel, p_memdrv_info->cnt, p_memdrv_info->p_data, spcmd_cmd_word);
    if (MEMDRV_SUCCESS != ret_memdrv)
    {
        r_rspi_exchg(p_memdrv_info->p_data, p_memdrv_info->cnt);
        return MEMDRV_ERR_OTHER;
    }
    r_rspi_exchg(p_memdrv_info->p_data, p_memdrv_info->cnt);

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_rx_data() */
#elif (MEMDRV_CFG_DEV0_TYPE ==0)  | (MEMDRV_CFG_DEV1_TYPE ==0)
memdrv_err_t r_memdrv_rspi_rx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    rspi_command_word_t     spcmd_cmd_word;
    rspi_err_t     ret_drv = RSPI_SUCCESS;
    memdrv_err_t   ret_memdrv = MEMDRV_SUCCESS;
    rspi_cmd_trans_mode_t   mode;

    uint32_t                bound_cnt = 0;
    uint8_t *               pdest = p_memdrv_info->p_data;
    uint32_t                rxcnt = p_memdrv_info->cnt;
    uint32_t                rem_rxcnt = rxcnt / RSPI_EXCHG_MAX_COUNT;
    uint32_t                mod_rxcnt = rxcnt % RSPI_EXCHG_MAX_COUNT;

    if (0 != ((uint32_t)(p_memdrv_info->p_data) & MEMDRV_ADDR_BOUNDARY))
    {
        bound_cnt = (0x00000004 - ((uint32_t)(p_memdrv_info->p_data) & MEMDRV_ADDR_BOUNDARY));
        rxcnt = bound_cnt;
        mode.transfer_mode = RSPI_TRANS_MODE_SW;
#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif /* (__ICCRX__) */
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }

        ret_memdrv = r_memdrv_rspi_read_data(channel, rxcnt, pdest, spcmd_cmd_word);
        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            return MEMDRV_ERR_OTHER;
        }

        pdest = (uint8_t *)(p_memdrv_info->p_data + bound_cnt);
        rxcnt = p_memdrv_info->cnt - bound_cnt;
    }
    if (0 != (rxcnt & 0xfffffffc))
    {
        rxcnt = (rxcnt & 0xfffffffc);
        mode.transfer_mode = r_memdrv_rspi_set_tran_mode(devno);

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_DATA_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_DATA_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_DATA_CMD;
#endif /* (__ICCRX__) */
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_enable_rx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_enable_rx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_enable_rx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_enable_rx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        r_rspi_exchg(pdest, rxcnt);
        /* Turn 32 digits into 16 digits */
        if (rem_rxcnt >= 1)
        {
            /* WAIT_LOOP */
            while(rem_rxcnt)
            {
                ret_memdrv = r_memdrv_rspi_read_data(channel, RSPI_EXCHG_MAX_COUNT, pdest, spcmd_cmd_word);
                if (MEMDRV_SUCCESS != ret_memdrv)
                {
                    return ret_memdrv;
                }
                pdest = (uint8_t *)(pdest + RSPI_EXCHG_MAX_COUNT);
                rem_rxcnt--;
            }
            ret_memdrv = r_memdrv_rspi_read_data(channel, mod_rxcnt, pdest, spcmd_cmd_word);
        }
        else
        {
            ret_memdrv = r_memdrv_rspi_read_data(channel, rxcnt, pdest, spcmd_cmd_word);
        }

        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            r_rspi_exchg(pdest, rxcnt);
            return MEMDRV_ERR_OTHER;
        }
        r_rspi_exchg(pdest, rxcnt);

        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_rx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_rx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_rx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_rx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        pdest = (uint8_t *)(pdest + rxcnt);
    }
    if (0 != ((uint32_t)(p_memdrv_info->cnt - bound_cnt) & MEMDRV_CHK_MULT_OF_4))
    {
        rxcnt = ((uint32_t)(p_memdrv_info->cnt - bound_cnt) & MEMDRV_CHK_MULT_OF_4);
        mode.transfer_mode = RSPI_TRANS_MODE_SW;

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
    #if defined (__ICCRX__)
    uint16_t temp;
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
    temp = (spcmd_cmd_word.word[0] >> 8);
    temp |= (spcmd_cmd_word.word[0] << 8);
    spcmd_cmd_word.word[0] = temp;
    #else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif /* (__ICCRX__) */
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }

