renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rspi.c
        ret_memdrv = r_memdrv_rspi_read_data(channel, rxcnt, pdest, spcmd_cmd_word);
        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            return MEMDRV_ERR_OTHER;
        }
    }

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_rx_data() */
#endif
/*******************************************************************************
* Function Name: r_memdrv_rspi_1ms_interval
* Description  : 1ms Interval Timer call function.
* Arguments    : none
* Return Value : none
*******************************************************************************/
void r_memdrv_rspi_1ms_interval(void)
{
    uint8_t channel = 0;
    /* WAIT_LOOP */
    for (channel = 0; channel < RSPI_MAX_CHANNELS; channel++)
    {
        if (gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_FLG] != 0)
        {
            gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_COUNT]++;
        }
    }
} /* End of function r_memdrv_rspi_1ms_interval() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_set_tran_mode
* Description  : Sets transfer mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
* Return Value : RSPI_TRANS_MODE_SW
*              : RSPI_TRANS_MODE_DMAC
*              : RSPI_TRANS_MODE_DTC
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static rspi_str_tranmode_t r_memdrv_rspi_set_tran_mode(uint8_t devno)
{
    rspi_str_tranmode_t mode = RSPI_TRANS_MODE_SW;

#if (MEMDRV_CFG_DEV0_INCLUDED == 1)
    if (MEMDRV_DEV0 == devno)
    {
        if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
        {
            mode = RSPI_TRANS_MODE_DMAC;
        }
        else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
        {
            mode = RSPI_TRANS_MODE_DTC;
        }
        else
        {
            mode = RSPI_TRANS_MODE_SW;
        }
    }
#endif /* (MEMDRV_CFG_DEV0_INCLUDED == 1) */
#if (MEMDRV_CFG_DEV1_INCLUDED == 1)
    if (MEMDRV_DEV1 == devno)
    {
        if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
        {
            mode = RSPI_TRANS_MODE_DMAC;
        }
        else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
        {
            mode = RSPI_TRANS_MODE_DTC;
        }
        else
        {
            mode = RSPI_TRANS_MODE_SW;
        }
    }
#endif /* (MEMDRV_CFG_DEV1_INCLUDED == 1) */

    return mode;
} /* End of function r_memdrv_rspi_set_tran_mode() */
    
/*******************************************************************************
* Function Name: r_memdrv_rspi_start_timer
* Description  : Sets timer for checking timeout and start timer.
* Arguments    : channel -
*                    Which channel to use
*              : msec -
*                    timeout(msec order)
* Return Value : none
*******************************************************************************/
static void r_memdrv_rspi_start_timer(uint8_t channel, uint32_t msec)
{
    gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_FLG] = 1;
    gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_COUNT] = 0;
    gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_MAX_COUNT] = (uint32_t)(msec);
} /* End of function r_memdrv_rspi_start_timer() */

/*******************************************************************************
* Function Name: r_memdrv_rspi_check_timer
* Description  : Checks timeout to set r_memdrv_rspi_start_timer function.
*              : If timeout,return MEMDRV_ERR_HARD. 
*              : In the case of others, return MEMDRV_SUCCESS.
* Arguments    : channel -
*                    Which channel to use
* Return Value : MEMDRV_SUCCESS -
*                    Successful operation
*                MEMDRV_ERR_HARD -
*                    Hardware error
*******************************************************************************/
static memdrv_err_t r_memdrv_rspi_check_timer(uint8_t channel)
{
    memdrv_err_t ret_drv = MEMDRV_SUCCESS;
    uint32_t gs_memdrv_rspi_timer_cnt_out1 = gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_COUNT];
    uint32_t gs_memdrv_rspi_timer_cnt_out2 = gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_MAX_COUNT];

    /* ---- Check compare ---- */
    if (gs_memdrv_rspi_timer_cnt_out1 >= gs_memdrv_rspi_timer_cnt_out2)
    {
        ret_drv = MEMDRV_ERR_HARD;
    }
    else
    {
        ret_drv = MEMDRV_SUCCESS;
    }

    return ret_drv;
} /* End of function r_memdrv_rspi_check_timer() */

/*******************************************************************************
* Function Name: r_memdrv_rspi_end_timer
* Description  : Stops timer to set r_memdrv_rspi_start_timer function.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
static void r_memdrv_rspi_end_timer(uint8_t channel)
{
    gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_FLG] = 0;
} /* End of function r_memdrv_rspi_end_timer() */

/*******************************************************************************
* Function Name: r_memdrv_rspi_wait
* Description  : Waits for reception completion.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : MEMDRV_SUCCESS -
*                    Successful operation
*                MEMDRV_ERR_HARD -
*                    Hardware error
*******************************************************************************/
static memdrv_err_t r_memdrv_rspi_wait(uint8_t channel, uint32_t size)
{
    memdrv_err_t    ret_drv  = MEMDRV_SUCCESS;
    uint32_t               time = RSPI_TIMER_MIN_TIME;     // 100ms        

    /* ---- Check DMAC/DTC transfer end.  --- */
    /* Timeout value depends on transfer size. 
       Minimum time is 100ms. When the data count exceeds 10 sectors (1 sector = 512 bytes),
       increase 10ms time for 1 sector increase.*/
    if ((RSPI_SECTOR_SIZE * 10) < size)
    {
        time = (time + (((size / RSPI_SECTOR_SIZE) - 10) * 10));
        if (0x0fffffff < time)
        {
            time = 0x0fffffff;
        }
    }

    /* Start timer. */
    r_memdrv_rspi_start_timer(channel, time);
    /* WAIT_LOOP */
    while (1)
    {
        /* Check timeout. */
        if (MEMDRV_ERR_HARD == r_memdrv_rspi_check_timer(channel))
        {
            ret_drv = MEMDRV_ERR_HARD;
            break;
        }
        if (false == g_transfer_busy)
        {
            break;
        }
    }

    r_memdrv_rspi_end_timer(channel);

    return ret_drv;
}  /* End of function r_memdrv_rspi_wait() */

/*****************************************************************************
* Function Name: r_memdrv_rspi_callback
* Description  : This is an example of an RSPI callback function.
* Arguments    : p_data - pointer to RSPI event code data.
* Return Value : None
******************************************************************************/
static void r_memdrv_rspi_callback(void *p_data)
{
    callback_event = (*(rspi_callback_data_t *)p_data).event_code;
    g_transfer_busy = false;

#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
    R_RSPI_IntSpriIerClear(g_rspi_handle);
    R_RSPI_IntSptiIerClear(g_rspi_handle);
    if (0 == g_rspi_handle->channel)
    {
#if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0) | \
    ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0)
        RSPI0.SPCR.BIT.SPE   = 0;  // Disable RSPI.
#if RSPI_CFG_REQUIRE_LOCK == 1
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0));
#endif
#endif
    }
    else if (1 == g_rspi_handle->channel)
    {
#if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1) | \
    ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1)
    {
        RSPI1.SPCR.BIT.SPE   = 0;  // Disable RSPI.
#if RSPI_CFG_REQUIRE_LOCK == 1
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI1));
#endif
#endif
    }
    else if (2 == g_rspi_handle->channel)
    {
#if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2) | \
    ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2)
        RSPI2.SPCR.BIT.SPE   = 0;  // Disable RSPI.
#if RSPI_CFG_REQUIRE_LOCK == 1
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI2));
#endif
#endif
    }
    else
    {
    }
#endif
} /* End of function r_memdrv_rspi_callback() */

/*****************************************************************************
* Function Name: rspi_init_ports
* Description  : This function initializes the port pins associated with
*                RSPI channel 0 using the macros defined in iodefine.h.
* Arguments    : None
* Return Value : None
******************************************************************************/
static void rspi_init_ports(void)
{
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_RSPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH0)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)   && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_RSPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH0)))
    R_RSPI_PinSet_RSPI0();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_RSPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH1)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)   && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_RSPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH1)))
    R_RSPI_PinSet_RSPI1();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_RSPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH2)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)   && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_RSPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH2)))
    R_RSPI_PinSet_RSPI2();
#endif
} /* End of function rspi_init_ports() */

/*****************************************************************************
* Function Name: r_memdrv_rspi_write_data
* Description  : Transmits data to a SPI  device.
* Arguments    : uint8_t         channel                ;   Device No. (MEMDRV_DEVn)
*              : uint16_t        count                  ;   Indicates the number of data words to be transferred.
*              : uint8_t         * pdata                ;   Buffer pointer
*              : rspi_command_word_t  cmd               ;   Consisting of all the RSPI command register settings.
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
******************************************************************************/
static memdrv_err_t r_memdrv_rspi_write_data(uint8_t channel,
                                             uint16_t count,
                                             uint8_t * pdata,
                                             rspi_command_word_t cmd)
{
    rspi_err_t     ret_drv = RSPI_SUCCESS;

    g_transfer_busy = true;

#if RSPI_LITTLE_ENDIAN == 1
    if (MEMDRV_TRNS_DATA_CMD == cmd.word[0])
    {
        count = count >> 2;
    }
#else
    if (MEMDRV_TRNS_DATA_CMD == cmd.word[1])
    {
        count = count >> 2;
    }
#endif
    ret_drv = R_RSPI_Write(g_rspi_handle,
                           cmd,
                           pdata,
                           count);
    if   (RSPI_SUCCESS != ret_drv)
    {
        return MEMDRV_ERR_OTHER;
    }

    /* Wait for transmission completion. */
    if (0 > r_memdrv_rspi_wait(channel, count))
    {
        /* ---- Disable RSPI transmission. ---- */
        R_RSPI_IntSptiIerClear(g_rspi_handle);
        R_RSPI_IntSpriIerClear(g_rspi_handle);
        g_rspi_handle->channel = channel;
        if (RSPI_SUCCESS != R_RSPI_Close(g_rspi_handle))
        {
            return MEMDRV_ERR_OTHER;
        }
        return MEMDRV_ERR_OTHER;
    }

    if (RSPI_EVT_TRANSFER_COMPLETE != callback_event)
    {
        return MEMDRV_ERR_OTHER;
    }
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_write_data() */

/*****************************************************************************
* Function Name: r_memdrv_rspi_read_data
* Description  : Receives data from a SPI device.
* Arguments    : uint8_t         channel                ;   Device No. (MEMDRV_DEVn)
*              : uint16_t        count                  ;   Indicates the number of data words to be transferred.
*              : uint8_t         * pdata                ;   Buffer pointer
*              : rspi_command_word_t  cmd               ;   Consisting of all the RSPI command register settings.
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_OTHER                       ;   Other error
******************************************************************************/
static memdrv_err_t r_memdrv_rspi_read_data(uint8_t channel,
                                            uint16_t count,
                                            uint8_t * pdata,
                                            rspi_command_word_t cmd)
{
    rspi_err_t     ret_drv = RSPI_SUCCESS;

    g_transfer_busy = true;

#if RSPI_LITTLE_ENDIAN == 1
    if (MEMDRV_TRNS_DATA_CMD == cmd.word[0])
    {
        count = count >> 2;
    }
#else
    if (MEMDRV_TRNS_DATA_CMD == cmd.word[1])
    {
        count = count >> 2;
    }
#endif
    ret_drv = R_RSPI_Read(g_rspi_handle,
                           cmd,
                           pdata,
                           count);
    if   (RSPI_SUCCESS != ret_drv)
    {
        return MEMDRV_ERR_OTHER;
    }

    /* Wait for transmission completion. */
    if (0 > r_memdrv_rspi_wait(channel, count))
    {
        /* ---- Disable RSPI transmission. ---- */
        R_RSPI_IntSptiIerClear(g_rspi_handle);
        R_RSPI_IntSpriIerClear(g_rspi_handle);
        g_rspi_handle->channel = channel;
        if (RSPI_SUCCESS != R_RSPI_Close(g_rspi_handle))
        {
            return MEMDRV_ERR_OTHER;
        }
        return MEMDRV_ERR_OTHER;
    }

    if (RSPI_EVT_TRANSFER_COMPLETE != callback_event)
    {
        return MEMDRV_ERR_OTHER;
    }
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_read_data() */

